design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Deadlock Detection Project</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Deadlock Detection Project"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-07T10:21-0500"/>
<meta name="author" content="Jordon Biondo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Deadlock Detection Project</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Design Document</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Data Structures</h3>
<div class="outline-text-3" id="text-1-1">

<p>The main data structure is the process datastructure, it has three threads to simulate a process. A Simulated top level process thread, a main execution thread and a messenger thread. It also holds flags to tell if it is deadlocked, or killed. It also holds a list of owned resources and requested resources. It is shown below
</p>


<pre class="example">/**
 * Simulated process type
 */
typedef struct {
  pthread_t simulation;         // the simulated process thread id
  pthread_t worker;             // the worker thread, reports deadlock
  pthread_t messager;           // sends/recieves/forwards probes, finds deadlock
  int messages[2];              // processes communication pipe
  pthread_mutex_t msg_mutex;    // mutex for safe pipe IO  
  int requesting;               // index of requested resource
  bool owning[RESOURCE_LIMIT];  // list of owned resource indices
  bool active;                  // is the process active? (used in the config)
  bool deadlocked;              // true when deadlock found
  bool killed;                  // when to stop all process threads
} sim_process;

</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Grammar</h3>
<div class="outline-text-3" id="text-1-2">

<p>Flex and Yacc are used to parse configuration files which allows for easier future extension to the process state configuration files.
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Algorithm</h3>
<div class="outline-text-3" id="text-1-3">

<p>The program follows the same algorithm as described in the specification. After parsing the text, the simulated processes are started and probes begin to be sent. Probes are sent via pipes. Each simulated process has it's own pipe and mutex to control safe IO to that pipe.
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-11-07T10:21-0500</p>
<p class="author">Author: Jordon Biondo</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
